Table of Contents
 Class BoltAssembly
Namespace
IdeaRS.OpenModel.Material
Assembly
IdeaRS.OpenModel.dll
Bolt assembly
[OpenModelClass("CI.StructModel.Libraries.Material.BoltAssembly,CI.Material", "CI.StructModel.Libraries.Material.BoltAssembly,CI.Material", typeof(BoltAssembly))]
public class BoltAssembly : OpenElementId
Inheritance
object
OpenObject
OpenElementId
BoltAssembly
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 BoltGrade
Bolt grade
public ReferenceElement BoltGrade { get; set; }
Property Value
ReferenceElement
 Borehole
Size of borehole
public double Borehole { get; set; }
Property Value
double
 DiagonalHeadDiameter
Second diameter of the head
public double DiagonalHeadDiameter { get; set; }
Property Value
double
 Diameter
Bolt diameter
public double Diameter { get; set; }
Property Value
double
 GrossArea
Gross cross-section area
public double GrossArea { get; set; }
Property Value
double
 HeadDiameter
Diameter of the head
public double HeadDiameter { get; set; }
Property Value
double
 HeadHeight
Thickness of head
public double HeadHeight { get; set; }
Property Value
double
 Name
Name of bolt assembly
public string Name { get; set; }
Property Value
string
 NutThickness
Thickness of Nut
public double NutThickness { get; set; }
Property Value
double
 TensileStressArea
Tensile stress area
public double TensileStressArea { get; set; }
Property Value
double
 WasherAtHead
Washer at head side of bolt assembly
public bool WasherAtHead { get; set; }
Property Value
bool
 WasherAtNut
Is washer at Nut side of bolt assembly
public bool WasherAtNut { get; set; }
Property Value
bool
 WasherThickness
Thickness of washer
public double WasherThickness { get; set; }
Property Value
double
 Edit this page